quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для сложения в Python?',
        'options': ['+', '-', '*', '/'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод используется для добавления элемента в конец списка в Python?',
        'options': ['append()', 'add()', 'insert()', 'extend()'],
        'correct_option': 0
    },
    {
        'question': 'Что такое переменная в программировании?',
        'options': ['Место для хранения данных', 'Функция', 'Тип данных', 'Цикл'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для проверки равенства в Python?',
        'options': ['==', '=', '!=', '<>'],
        'correct_option': 0
    },
    {
        'question': 'Что такое цикл в программировании?',
        'options': ['Конструкция для повторения кода', 'Переменная', 'Функция', 'Ошибка'],
        'correct_option': 0
    },
    {
        'question': 'Какой из этих типов данных не существует в Python?',
        'options': ['natural', 'int', 'float', 'str'],
        'correct_option': 0
    },
    {
        'question': 'Что делает функция print() в Python?',
        'options': ['Выводит информацию на экран', 'Сохраняет данные в файл', 'Создаёт переменную', 'Удаляет элемент из списка'],
        'correct_option': 0
    },
    {
        'question': 'Какой символ используется для комментариев в Python?',
        'options': ['#', '//', '<!--', '--'],
        'correct_option': 0
    }
]